[
  {
    "Title": "EL Support and Strategies",
    "Spots": 24,
    "Presenter(s)": "Heather Sanchez",
    "Grade": "K-5, 6-8, Special Area",
    "Building": "Sylvan",
    "Area of Focus": "Support for English Learners",
    "Description": "Strategies to support ELs in the general Ed classroom. Ways to modify curriculum to meet the needs of EL learners.",
    "Intended Audience": "All teachers"
  },
  {
    "Title": "Informal Assessments",
    "Spots": 0,
    "Presenter(s)": "Helena Darah",
    "Grade": "9-12, Special Education/Intervention",
    "Building": "Northview",
    "Area of Focus": "Instructional Supports for All Students",
    "Description": "I attended a HSTW conference in Columbus, OH and learned a vast amount of quick, easy and extremely beneficial informal assessments that I've been utilizing in my Essentials and my Co-Taught class on a daily basis. One of them is called \"whip around\", the other is the Quizzizz game to test for class accuracy and to measure growth and a few more. My students enjoy these mini assessments and benefit from them. They are inclusive as no student is singled out and it can assess comprehension and mastery for the whole classroom.  I'd like to talk about quick and easy formal and informal assessments which can be used every day in any classroom setting. I frequently teach lessons in the co-taught setting (about 3 times a week) and have 3 of my own Essentials Classes and the assessments work in all of them. \n\nThe first is \"whip around and pass\" which I learned at the HSTW Seminar in Columbus. The second I learned from a colleague (George France) called \"Quizzizz\" which is great for goal-setting per lesson and can pin-point areas where students still struggle. \"Caption it\" is great for the Social Studies and Science courses for students to make a caption to a picture posted based on what they learned in the lesson (also good for inference skills). Finally, strategic multiple choice, which has the teacher create multiple choice questions which may \"trick\" the student. The objective is to have the students explain why the other options are incorrect and how they made the mistake. \n\nI am also SIMS trained and have great mnemonic device strategies for studying, vocabulary strategies and reading comprehension strategies. So, if informal assessments are already covered by another teacher, I'd be happy to teach strategies for all students.",
    "Intended Audience": "All teachers"
  },
  {
    "Title": "Mastering the OTES: Supporting All Students",
    "Spots": 0,
    "Presenter(s)": "David Malolepszy",
    "Grade": "K-12",
    "Building": "Timberstone",
    "Area of Focus": "Instructional Supports for All Students",
    "Description": "“Moving from Skilled to Accomplished”\nTechniques, Tactics, and Need to Know Nuggets for understanding accomplished language and how to demonstrate it throughout the OTES cycle.",
    "Intended Audience": "All teachers"
  },
  {
    "Title": "SCRIBE writing technique",
    "Spots": 8,
    "Presenter(s)": "Laurie Aulls and Rachel Molnar",
    "Grade": "9-12, Special Education/Intervention",
    "Building": "Southview",
    "Area of Focus": "Instructional Supports for All Students",
    "Description": "Learn how to teach the SIMs SCRIBE writing technique to help all students improve their written expression.  This can be used in the elementary- high school and across the curriculum.",
    "Intended Audience": "All teachers"
  },
  {
    "Title": "Science Themed Breakouts",
    "Spots": 10,
    "Presenter(s)": "Jennifer McDonald",
    "Grade": "6-8",
    "Building": "Timberstone",
    "Area of Focus": "Instructional Supports for All Students",
    "Description": "Have you heard of escape rooms in the classroom, but never tried one?  This presentation will walk you through how a typical Breakout activity goes with some insight into how to organize groups and materials.  You will be an active participant in a middle level science breakout!",
    "Intended Audience": "All teachers, Science teachers"
  },
  {
    "Title": "Growth Mindset and Resilience in the Classroom",
    "Spots": 3,
    "Presenter(s)": "Renee Stack",
    "Grade": "K-5, Counseling",
    "Building": "Stranahan",
    "Area of Focus": "Mental Health Supports",
    "Description": "Growth Mindset and Resilience are skills we would like all kids to learn and utilize in the classroom and in life. Incorporating some skills into your daily routine can help you become a role model.  We will go over many strategies that can be implemented into the classroom and school setting to cultivate and nourish a Growth Mindset while building the Skills for Resilience without interrupting too much instructional time. You will learn some basic research and practical strategies that will enrich your teaching and the educational setting.  This is also a follow up for \"Cultivating a Growth Mindset\" that I presented at a previous Professional Development opportunity.",
    "Intended Audience": "All teachers"
  },
  {
    "Title": "Fact \"Strats\" and Songs",
    "Spots": 15,
    "Presenter(s)": "Desi Grohnke",
    "Grade": "K-5",
    "Building": "Stranahan",
    "Area of Focus": "Instructional Supports for All Students",
    "Description": "Are your students relying on their fingers to solve addition and subtraction facts?\nThrough games and specific fact exercises, students can become thinkers rather than counters. We will focus on using strategies for solving addition and subtraction facts.  For those students who struggle with multiplication and division facts, the Multiples Songs can help them be successful. You will learn how to teach the songs and how to help students use them. All students including English Learners will benefit from the tools presented.",
    "Intended Audience": "Math teachers, Music teachers, Special Education teachers"
  },
  {
    "Title": "CPI training",
    "Spots": 14,
    "Presenter(s)": "Holly Nartker",
    "Grade": "6-8, Special Education/Intervention",
    "Building": "McCord",
    "Area of Focus": "Mental Health Supports",
    "Description": "Crisis PREVENTION Intervention...giving every classroom teacher the tools to deescalate and better manage student behavior BEFORE it gets out of control.  This training will also provide the techniques needed to keep your students and yourself safe in times of crisis should it arise.",
    "Intended Audience": "All teachers, Paraprofessionals"
  },
  {
    "Title": "Not mine - I would really like to encourage you to bring in Erin Wiley of the Willow Center to discuss teacher burnout",
    "Spots": 9,
    "Presenter(s)": "Brandi Shepard",
    "Grade": "9-12",
    "Building": "Southview",
    "Area of Focus": "Mental Health Supports",
    "Description": "Avoiding Teacher Burnout",
    "Intended Audience": "All teachers"
  },
  {
    "Title": "Universal Strategies for Students with Disabilities in Co-Taught AND Gen-Ed Classrooms",
    "Spots": 6,
    "Presenter(s)": "Lauren Stewart and MaGee Barber",
    "Grade": "9-12, Special Education/Intervention",
    "Building": "Northview",
    "Area of Focus": "Support for Students with Disabilities",
    "Description": "Take a look into the universal strategies (including standards-based grading) we have implemented in 9th grade Physical Science, both co-taught and general education, to support students with disabilities. These strategies are designed to help ALL students succeed, not just students with identified disabilities. Strategies in this session will not be limited to science courses.",
    "Intended Audience": "All teachers"
  },
  {
    "Title": "Social Emotional Learning in the classroom",
    "Spots": 6,
    "Presenter(s)": "Claudia Fischer",
    "Grade": "9-12",
    "Building": "Northview",
    "Area of Focus": "Mental Health Supports",
    "Description": "What is trauma, resilience, and what difference does it make in my classroom",
    "Intended Audience": "All teachers"
  },
  {
    "Title": "An Introduction to SIOP: A Comprehensive Approach to Supporting English Learners",
    "Spots": 0,
    "Presenter(s)": "Alyssa Kuebeck",
    "Grade": "K-5",
    "Building": "Stranahan",
    "Area of Focus": "Support for English Learners",
    "Description": "In this session, we will get a brief overview of the Sheltered Instruction Observation Protocol (SIOP) model and how it systematically can change your approach to better instructing English Learners in your classroom. We will dive in deep to explore a few of the eight components of SIOP that will immediately help you instruct and support your ELs more effectively.",
    "Intended Audience": "All teachers, k-12 teachers who work with English Learners"
  },
  {
    "Title": "Engaging All Learners in the General Music Classroom with Quaver Music",
    "Spots": 1,
    "Presenter(s)": "Megan Rhodes",
    "Grade": "Special Area",
    "Building": "Hill View",
    "Area of Focus": "Elementary General Music",
    "Description": "This session will present a variety of ways in which the Quaver Music Program is beneficial in engaging all learners in the General Music classroom. Topics covered will be pairing verbals with visuals for EL students, exploring the benefits of a visual program for students with limited communication skills, motivating students with attention difficulties, and increasing technology skills for all students.",
    "Intended Audience": "Music teachers"
  },
  {
    "Title": "Adding real life pics to student visuals",
    "Spots": 23,
    "Presenter(s)": "Kim Beil",
    "Grade": "Special Education/Intervention",
    "Building": "Southview",
    "Area of Focus": "Support for Students with Disabilities",
    "Description": "Do you want to add real pictures from the student's world to create visuals to use in multi-step directions, social stories, student schedules, task completion, etc.? Taking pictures from your phone and adding them to visuals in google drive or google slides is easy and effective when creating materials to support students who learn best visually. This is originally intended for M/I teachers but may help ESL teachers as pictures are universal in language development.",
    "Intended Audience": "Special Education teachers, Paraprofessionals, ELL"
  },
  {
    "Title": "Media specialists supporting students",
    "Spots": 5,
    "Presenter(s)": "Darla Omey",
    "Grade": "9-12",
    "Building": "Northview",
    "Area of Focus": "Support for all students using library media center resources",
    "Description": "Our media specialists will plan activities and events to support students. The goal is to align standards in the library media centers in the District and to then correlate them with the classroom standards, thus supporting all learners.  As you know, being such a small group in many different buildings, we do not often have time to meet to discuss our individual needs.  I thought the purpose of this day was to allow for some time, if we so chose to plan for it, letting us reconnect and provide professional development where we need it.",
    "Intended Audience": "Library media specialists"
  },
  {
    "Title": "Understanding Childhood Trauma, Its Impact in the Classroom, and Using Restorative Practices",
    "Spots": 0,
    "Presenter(s)": "Ciara Holinski and Maria Arite",
    "Grade": "Speech/OTPT/Psych",
    "Building": "Bradley J. Rieger Building",
    "Area of Focus": "Mental Health Supports",
    "Description": "This presentation will outline the mental and physiological impact of childhood trauma and potential challenges or barriers to school success. The use of restorative practices and intervention strategies will be discussed as well as ways of implementing these techniques in the classroom/school environment. Additional resources and intervention materials will be shared with participants.",
    "Intended Audience": "All teachers, Guidance Counselors, Special Education teachers, Paraprofessionals, Administration"
  },
  {
    "Title": "Creating Products To Meet All WL Student's Interpersonal Speaking Needs",
    "Spots": 0,
    "Presenter(s)": "Lindsey Jurski",
    "Grade": "9-12",
    "Building": "Northview",
    "Area of Focus": "World Language Interpersonal Speaking Instruction For All",
    "Description": "Who doesn't want to leave a workshop with student-ready materials? This session will create a collaborative environment for World Language teachers to create differentiated interpersonal speaking products and will follow the 2 session presentation from Kathy Shelton.",
    "Intended Audience": "World Language teachers"
  },
  {
    "Title": "Using INFohio Resources to Differentiate Learning",
    "Spots": 7,
    "Presenter(s)": "Laurie McCrary",
    "Grade": "9-12",
    "Building": "Southview",
    "Area of Focus": "Instructional Supports for All Students",
    "Description": "Join this hands-on session to utilize the resources and activities located on the INFOhio website to differentiate your student's learning.",
    "Intended Audience": "All teachers"
  },
  {
    "Title": "Restorative Justice and Behavioral Strategies for Secondary Classrooms",
    "Spots": 15,
    "Presenter(s)": "Hanna Wutrick and Megan Houts",
    "Grade": "9-12, Speech/OTPT/Psych",
    "Building": "Southview",
    "Area of Focus": "Mental Health Supports",
    "Description": "This session will provide a brief overview of Restorative Justice concepts and dig deeper into applications in the classroom to improve behavior.  It will also provide practical tools that educators and other school staff can use to turn classroom discipline from a punitive experience to a positive learning opportunity.  This session will focus on the secondary level.",
    "Intended Audience": "All teachers, Secondary Level"
  },
  {
    "Title": "Math Support in the Intervention Specialist Classroom",
    "Spots": 25,
    "Presenter(s)": "April McGough",
    "Grade": "9-12",
    "Building": "Southview",
    "Area of Focus": "Support for Students with Disabilities",
    "Description": "Are you an Intervention Specialist that works daily with your students on Math?  Are you working to help them raise their score on the OST?  Are you a math teacher that has not fully integrated Desmos into your classroom?? Come learn about how to utilize Desmos and other calculators in your review to help them succeed! This session will provide insight on how to use the resources as well as practice time where you can ask questions and get instant feedback.  I will also share practice OST questions that your students can use to review for the upcoming OST!",
    "Intended Audience": "Math teachers, Special Education teachers"
  },
  {
    "Title": "Meeting all World Language Students' Interpersonal Needs",
    "Spots": 0,
    "Presenter(s)": "Lucas Hoffman",
    "Grade": "9-12",
    "Building": "Southview",
    "Area of Focus": "Support for World Language Learners",
    "Description": "This is a combined first and second session (2.5 hours) in a series focused on differentiating in the world language classroom.  ODE World Language Education Program Specialist Kathy Shelton will present best practices as it relates to differentiation and strategies to help students improve their interpersonal speaking and writing.  Following this combined session, participants will continue with a third workshop-time session.",
    "Intended Audience": "World Language teachers"
  },
  {
    "Title": "Understanding \"Privelege\" and how it impacts our students.",
    "Spots": 20,
    "Presenter(s)": "Dan Greenberg",
    "Grade": "9-12",
    "Building": "Southview",
    "Area of Focus": "Instructional Supports for All Students",
    "Description": "Sylvania student population is increasingly diverse, and educators need to understand how \"privilege\" impacts our ability to meet the needs of all students.  Whether it is scheduling the first day of school on the Muslim holiday of Eid or offering extra credit for food drives, when the same students are receiving support from the food bank...  If we better understand how \"privilege\" plays a role in our school policies and culture, we can better meet the needs of all students.",
    "Intended Audience": "All teachers"
  },
  {
    "Title": "Things college didn't teach you about being a teacher",
    "Spots": 17,
    "Presenter(s)": "Dan Greenberg",
    "Grade": "9-12",
    "Building": "Southview",
    "Area of Focus": "Early Career Educators",
    "Description": "OEA Labor Consultant - Frederick Pruitt will lead this session, helping early career teachers understand critical classroom issues and gain skills to increase their effectiveness in the classroom and the profession, in general.",
    "Intended Audience": "Early Career Educators"
  },
  {
    "Title": "How Ohio's New Educator (ONE) Program supports Early Career Educators",
    "Spots": 15,
    "Presenter(s)": "Dan Greenberg",
    "Grade": "9-12",
    "Building": "Southview",
    "Area of Focus": "Support for Early Career Educators",
    "Description": "A significant percentage of teachers leave the profession within the first five years.  The ONE programs connects early career educators within the district and across the state to create a community of support for teachers who are just getting started in the classroom.  Learn about the ONE program and the opportunities it presents, including conferences and social events throughout the year.",
    "Intended Audience": "Early Career Educators (5 years or less)"
  },
  {
    "Title": "True Colors Training",
    "Spots": 15,
    "Presenter(s)": "Dan Greenberg",
    "Grade": "9-12",
    "Building": "Southview",
    "Area of Focus": "Educator Professionalism and Collaboration",
    "Description": "True Colors Training is an opportunity to learn about yourself and your colleagues in a entertaining, engaging manner.  An OEA Consultant will lead participants through several activities that will help them discover their \"colors\" and better understand how to work with others.",
    "Intended Audience": "All teachers"
  },
  {
    "Title": "Restorative Practices; reframing classroom management and discipline policies in Sylvania Schools",
    "Spots": 12,
    "Presenter(s)": "Dan Greenberg",
    "Grade": "9-12",
    "Building": "Southview",
    "Area of Focus": "Supports for all Students",
    "Description": "School districts across the country are moving away from detentions, suspensions and expulsions as a means to change student behavior.  Learn how restorative practices can be used in your classroom and your school to improve student behavior.",
    "Intended Audience": "All teachers"
  },
  {
    "Title": "Transforming School Culture and Climate: The Servant Leadership Model in Schools",
    "Spots": 6,
    "Presenter(s)": "Dan Greenberg",
    "Grade": "9-12",
    "Building": "Southview",
    "Area of Focus": "School Climate",
    "Description": "This session, presented by Chris Clayton of the Pennsylvania Education Association, details how educators can implement and utilize a platform of character education and servant leadership within schools to foster a more positive, safe, inclusive and welcoming school climate and culture.  A culture of servant leadership within schools, for both the staff and students can be truly transformative in changing the culture of a school and the community it serves, and participants will emerge from the session with understanding and framework for actualizing the Servant Leadership model in their school.",
    "Intended Audience": "All 6-12th grade teachers"
  },
  {
    "Title": "Supports in Elementary Art (I feel like this should have a more clever title;)",
    "Spots": 4,
    "Presenter(s)": "Tina ARndT",
    "Grade": "Special Area",
    "Building": "Central Trail",
    "Area of Focus": "All of the above in the elementary classroom",
    "Description": "Elementary Art teachers will share ideas and generate additional strategies to support All of the 500+ students in grades K-5 taught each week. This will include students with mental health issues, disabilities, gifted students, and English learners.",
    "Intended Audience": "Art teachers"
  },
  {
    "Title": "IEP Writing & District Rep Checklist",
    "Spots": 3,
    "Presenter(s)": "Christie Soltman (Special Ed Coordinators)",
    "Grade": "Special Education/Intervention",
    "Building": "Bradley J. Rieger Building",
    "Area of Focus": "Support for Students with Disabilities",
    "Description": "This session will focus on the development of IEPs in order to support students with disabilities and to ensure they receive targeted skill instruction. This training will include the mandated components of the IEP as well as how to ensure compliance with the district rep checklist.  This session is especially relevant for newer intervention specialists with less than 3 years experience or new to the district.",
    "Intended Audience": "Special Education teachers"
  },
  {
    "Title": "Supporting Teachers and their Instruction of English Learners",
    "Spots": 15,
    "Presenter(s)": "Crystal Burnworth",
    "Grade": "9-12, Counseling",
    "Building": "Northview",
    "Area of Focus": "Support for English Learners",
    "Description": "Ms. Janecko and Ms. Burnworth will share examples of how to support EL students within your content area.\n\nThis workshop will be dedicated in developing best practices and how to implement quality instruction for those with limited English skills.",
    "Intended Audience": "All teachers"
  },
  {
    "Title": "Strategies for Teaching Students with Fetal Alcohol Syndrome",
    "Spots": 21,
    "Presenter(s)": "Sister Suzette Fisher",
    "Grade": "Special Area",
    "Building": "Bradley J. Rieger Building",
    "Area of Focus": "Mental Health Supports",
    "Description": "Double Ark Center for Fetal Alcohol --A Renewed Mind",
    "Intended Audience": "All teachers"
  },
  {
    "Title": "Strategies to (re)ignite independent reading in your classroom",
    "Spots": 16,
    "Presenter(s)": "Kate Strausbaugh",
    "Grade": "6-8, Special Area",
    "Building": "McCord",
    "Area of Focus": "Instructional Supports for All Students",
    "Description": "Do your students seem disengaged with independent reading? Do you need some new ideas for your English/reading curriculum? Attend this session to learn about the benefits of adding independent reading into your curriculum while getting some new ideas to implement independent reading in your classroom! This session is designed for English/reading teachers in grades 6-12.",
    "Intended Audience": "ELA teachers, Reading teachers"
  },
  {
    "Title": "Cultural Sensitivity",
    "Spots": 15,
    "Presenter(s)": "Fatima Aldajani",
    "Grade": "9-12",
    "Building": "Northview",
    "Area of Focus": "Support for English Learners",
    "Description": "Teachers need to be aware of differences in cultural expectations and be patient with students who are adjusting to a new environment that may be very different from their native country or home. Understanding culture is important to understand how teachers can interact with individuals from cultures that are different, see ESL students more clearly, and shape policies and practice in ways that will help students to succeed.",
    "Intended Audience": "All teachers"
  },
  {
    "Title": "SIM Strategic Instructional Model-  Double session",
    "Spots": 4,
    "Presenter(s)": "Amy Loyd",
    "Grade": "9-12 Spec Ed",
    "Building": "NV",
    "Area of Focus": "Support for Students with Disabilities",
    "Description": "",
    "Intended Audience": ""
  },
  {
    "Title": "All Day Training Conscious Discipline",
    "Spots": 15,
    "Presenter(s)": "Gail Masse OR and Nancy Brown Psych",
    "Grade": "",
    "Building": 4747,
    "Area of Focus": "Support for Kindegarden students and MI students",
    "Description": "Equip educators to integrate social emotional learning , discipline, and self regulation so they spend less time policing behavior and more time teaching vital life skills",
    "Intended Audience": "Kindegarden teachers,Elementary MI teachers, Elementary Counsloers"
  },
  {
    "Title": "Guiding Early Reading with Learning A-Z",
    "Spots": 0,
    "Presenter(s)": "Lindsay Denny-Learning A-Z",
    "Grade": "Elementary Instructional Specialist",
    "Building": 4747,
    "Area of Focus": "Supporting students in grades K-2     LITERACY",
    "Description": "Join us to learn about Learning A-Z early reading resources for K-2. Raz Plus and Reading A-Z include many resources beyond leveled books! Phonological awareness lessons, high frequency word books, readers' theater scripts, and sound/symbol books are just some of the resources you will want to use for all your students this year. This session also introduces particpants to the exciting new program updates as well as our Journeys correlation. Please bring a laptop or chromebook to participate in this session. These resources will support all learners in the area of literacy.",
    "Intended Audience": "K-2 Teachers, Special Education Teachers, or anyone with a Raz Kids account"
  },
  {
    "Title": "Making Content Area Connections with Learning A-Z",
    "Spots": 5,
    "Presenter(s)": "Lindsay Denny-Learning A-Z",
    "Grade": "Elementary Instructional Specialist",
    "Building": 4747,
    "Area of Focus": "Supporting students in grades 3-5        LITERACY",
    "Description": "Join us to learn about Learning A-Z resources for grades 3-5. Raz Plus and Reading A-Z include many resources beyond leveled books that you can use to support content are connections and building 21st century reading skills! Argumentation and comprehension skill packs, paired books, visual devices, and informational texts are just some of the resources you will want to use this year. This session also introduces participants to the exciting new program updates as well as our Journeys correlation. Please bring a laptop or Chromebook to participate in this session. These resources will support all learners in the area of literacy.",
    "Intended Audience": ""
  },
  {
    "Title": "Blasting off with Learning A-Z",
    "Spots": 20,
    "Presenter(s)": "Lindsay Denny-Learning A-Z",
    "Grade": "Elementary Instructional Specialist",
    "Building": 4747,
    "Area of Focus": "Supporting students in grades K-5       LITERACY",
    "Description": "Are you new to Learning A-Z? In this beginners's session, we will cover the basics of navigating the teacher and student portals of Kids A-Z. Particpants will learn to access our Journeys correlation and how to find, organize, and assign resources. For Raz Kids and Raz Plas users, we will review how to manage your student roster and customize the student experience. We will also explore our exciting new progam updates. Please bring a laptop or Chromebook to participate in this session. These resources will support all learners in the area of literacy.",
    "Intended Audience": ""
  }
]